In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
""" JSON """

' JSON '

In [4]:
#Element JSON
obj = """
{"name":"Wes",
"places_lived" : ["United States","Spain","Germany"],
"pet":null,
"sibling":[{"name":"Scott","age":30,"pets":["Zeus","Zuko"]},
           {"name":"Katie","age":38,"pets":["Sixes","Stache","Cisco"]}]
           }
           """

In [5]:
#Convertir un elt JSON en Python
import json

In [6]:
result = json.loads(obj)

In [7]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'sibling': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [8]:
# Inversement convertir elt Python en JSON
asjson = json.dumps(result)

In [9]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "sibling": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [10]:
#extraire un Dataframe de result
siblings = pd.DataFrame(result['sibling'],columns=['name','age'])

In [11]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [12]:
#convertir un JSON en dataframe
data = pd.read_json('examples/example.json')

In [13]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
#Exporter un elt de pandas à JSON
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [15]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [16]:
""" XML and HTML : Web Scraping """

' XML and HTML : Web Scraping '

In [17]:
#Read_html :  parse les données tabulaires (<table>)
tables = pd.read_html('examples/fdic_bank.html')

In [18]:
len(tables)

1

In [19]:
failures = tables[0]

In [20]:
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","July 26, 2017"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"
5,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","March 7, 2018"
6,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"
7,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
8,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","September 25, 2017"
9,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","June 1, 2017"
10,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
11,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
12,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","March 13, 2017"
13,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","February 19, 2018"
14,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
15,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","February 20, 2018"
16,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
17,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"
18,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","April 21, 2015"
19,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","November 15, 2017"
20,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","November 15, 2017"
21,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 3, 2018"
22,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
23,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
24,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","February 19, 2018"

In [21]:
# Data cleaning : nombre de banques en faillite par année
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [22]:
close_timestamps.dt.year.value_counts()

2015    8
2017    8
2016    5
2014    4
Name: Closing Date, dtype: int64

In [23]:
# Parsing de XML avec lxml.objectify
from lxml import objectify

In [24]:
path = 'examples/Performance_MNRR.xml'

In [25]:
parsed= objectify.parse(open(path))

In [26]:
root = parsed.getroot()

In [27]:
root

In [28]:
data = []

In [29]:
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANCE','DECIMAL_PLACES']

In [30]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

AttributeError: no such child: pyval